
const sysData = {

    yijing_yao: [
      {Id:1, Name:'应',bgColor:'',Color:''},
      {Id:2, Name:'世',bgColor:'',Color:''}
    ],

    //农历节日
    lunarFestival : {
        'd0101':'春节',
        'd0115':'元宵节',
        'd0202':'龙抬头节',
        'd0323':'妈祖生辰',
        'd0505':'端午节',
        'd0707':'七夕情人节',
        'd0715':'中元节',
        'd0815':'中秋节',
        'd0909':'重阳节',
        'd1015':'下元节',
        'd1208':'腊八节',
        'd1223':'小年',
        'd0100':'除夕'
    },

    tg : ["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"],
    dz : ["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"],
    dz0 : ["丑","寅","卯","辰","巳","午","未","申","酉","戌","亥","子"],
    dzTest : ["巳","子","未","寅","酉","辰","亥","午","丑","申","卯","戌","巳"],


    jq : ["小寒","立春","惊蛰","清明","立夏","芒种","小暑","立秋","白露","寒露","立冬","大雪"],
    jq84 : [442208451146,444755924716,447326679845,449936540593,452591457618,455285317308,458000946032,460714673166,463403390187,466051355952,468654332864,471220083199],
    y_d84 : 441734400726,

    nayin : {
      甲子:["海中金"],乙丑:["海中金"],丙寅:["炉中火"],丁卯:["炉中火"],戊辰:["大林木"],己巳:["大林木"],庚午:["路旁土"],辛未:["路旁土"],壬申:["剑锋金"],癸酉:["剑锋金"],
      甲戌:["山头火"],乙亥:["山头火"],丙子:["涧下水"],丁丑:["涧下水"],戊寅:["城墙土"],己卯:["城墙土"],庚辰:["白腊金"],辛巳:["白腊金"],壬午:["杨柳木"],癸未:["杨柳木"],
      甲申:["泉中水"],乙酉:["泉中水"],丙戌:["屋上土"],丁亥:["屋上土"],戊子:["霹雳火"],己丑:["霹雳火"],庚寅:["松柏木"],辛卯:["松柏木"],壬辰:["长流水"],癸巳:["长流水"],
      甲午:["沙中金"],乙未:["沙中金"],丙申:["山下火"],丁酉:["山下火"],戊戌:["平地木"],己亥:["平地木"],庚子:["壁上土"],辛丑:["壁上土"],壬寅:["金箔金"],癸卯:["金箔金"],
      甲辰:["覆灯火"],乙巳:["覆灯火"],丙午:["天河水"],丁未:["天河水"],戊申:["大驿土"],己酉:["大驿土"],庚戌:["钗钏金"],辛亥:["钗钏金"],壬子:["桑柘木"],癸丑:["桑柘木"],
      甲寅:["大溪水"],乙卯:["大溪水"],丙辰:["沙中土"],丁巳:["沙中土"],戊午:["天上火"],己未:["天上火"],庚申:["石榴木"],辛酉:["石榴木"],壬戌:["大海水"],癸亥:["大海水"]
    },


    nayinList : [
      [
        { key:"甲子", value:"海中金", },
        { key:"乙丑", value:"海中金", },
        { key:"丙寅", value:"炉中火", },
        { key:"丁卯", value:"炉中火", },
        { key:"戊辰", value:"大林木", },
        { key:"己巳", value:"大林木", },
        { key:"庚午", value:"路旁土", },
        { key:"辛未", value:"路旁土", },
        { key:"壬申", value:"剑锋金", },
        { key:"癸酉", value:"剑锋金", }
      ],
      [
        { key:"甲戌", value:"山头火", },
        { key:"乙亥", value:"山头火", },
        { key:"丙子", value:"涧下水", },
        { key:"丁丑", value:"涧下水", },
        { key:"戊寅", value:"城墙土", },
        { key:"己卯", value:"城墙土", },
        { key:"庚辰", value:"白腊金", },
        { key:"辛巳", value:"白腊金", },
        { key:"壬午", value:"杨柳木", },
        { key:"癸未", value:"杨柳木", }
      ],
      [
        { key:"甲申", value:"泉中水", },
        { key:"乙酉", value:"泉中水", },
        { key:"丙戌", value:"屋上土", },
        { key:"丁亥", value:"屋上土", },
        { key:"戊子", value:"霹雳火", },
        { key:"己丑", value:"霹雳火", },
        { key:"庚寅", value:"松柏木", },
        { key:"辛卯", value:"松柏木", },
        { key:"壬辰", value:"长流水", },
        { key:"癸巳", value:"长流水", }
      ],
      [
        { key:"甲午", value:"沙中金", },
        { key:"乙未", value:"沙中金", },
        { key:"丙申", value:"山下火", },
        { key:"丁酉", value:"山下火", },
        { key:"戊戌", value:"平地木", },
        { key:"己亥", value:"平地木", },
        { key:"庚子", value:"壁上土", },
        { key:"辛丑", value:"壁上土", },
        { key:"壬寅", value:"金箔金", },
        { key:"癸卯", value:"金箔金", }
      ],
      [
        { key:"甲辰", value:"覆灯火", },
        { key:"乙巳", value:"覆灯火", },
        { key:"丙午", value:"天河水", },
        { key:"丁未", value:"天河水", },
        { key:"戊申", value:"大驿土", },
        { key:"己酉", value:"大驿土", },
        { key:"庚戌", value:"钗钏金", },
        { key:"辛亥", value:"钗钏金", },
        { key:"壬子", value:"桑柘木", },
        { key:"癸丑", value:"桑柘木", }
      ],
      [
        { key:"甲寅", value:"大溪水", },
        { key:"乙卯", value:"大溪水", },
        { key:"丙辰", value:"沙中土", },
        { key:"丁巳", value:"沙中土", },
        { key:"戊午", value:"天上火", },
        { key:"己未", value:"天上火", },
        { key:"庚申", value:"石榴木", },
        { key:"辛酉", value:"石榴木", },
        { key:"壬戌", value:"大海水", },
        { key:"癸亥", value:"大海水", }
      ]
    ],

    nayinListExt : [
      [
        { key:"甲子", value:"海中金", },
        { key:"乙丑", value:"海中金", },
        { key:"丙寅", value:"炉中火", },
        { key:"丁卯", value:"炉中火", },
        { key:"戊辰", value:"大林木", },
        { key:"己巳", value:"大林木", },
        { key:"庚午", value:"路旁土", },
        { key:"辛未", value:"路旁土", },
        { key:"壬申", value:"剑锋金", },
        { key:"癸酉", value:"剑锋金", },
        { key:"甲戌", value:"山头火", },
        { key:"乙亥", value:"山头火", }
      ],
      [
        { key:"丙子", value:"涧下水", },
        { key:"丁丑", value:"涧下水", },
        { key:"戊寅", value:"城墙土", },
        { key:"己卯", value:"城墙土", },
        { key:"庚辰", value:"白腊金", },
        { key:"辛巳", value:"白腊金", },
        { key:"壬午", value:"杨柳木", },
        { key:"癸未", value:"杨柳木", },
        { key:"甲申", value:"泉中水", },
        { key:"乙酉", value:"泉中水", },
        { key:"丙戌", value:"屋上土", },
        { key:"丁亥", value:"屋上土", },
      ],
      [
        { key:"戊子", value:"霹雳火", },
        { key:"己丑", value:"霹雳火", },
        { key:"庚寅", value:"松柏木", },
        { key:"辛卯", value:"松柏木", },
        { key:"壬辰", value:"长流水", },
        { key:"癸巳", value:"长流水", },
        { key:"甲午", value:"沙中金", },
        { key:"乙未", value:"沙中金", },
        { key:"丙申", value:"山下火", },
        { key:"丁酉", value:"山下火", },
        { key:"戊戌", value:"平地木", },
        { key:"己亥", value:"平地木", },

      ],
      [
        { key:"庚子", value:"壁上土", },
        { key:"辛丑", value:"壁上土", },
        { key:"壬寅", value:"金箔金", },
        { key:"癸卯", value:"金箔金", },
        { key:"甲辰", value:"覆灯火", },
        { key:"乙巳", value:"覆灯火", },
        { key:"丙午", value:"天河水", },
        { key:"丁未", value:"天河水", },
        { key:"戊申", value:"大驿土", },
        { key:"己酉", value:"大驿土", },
        { key:"庚戌", value:"钗钏金", },
        { key:"辛亥", value:"钗钏金", },
      ],
      [
        
        { key:"壬子", value:"桑柘木", },
        { key:"癸丑", value:"桑柘木", },
        { key:"甲寅", value:"大溪水", },
        { key:"乙卯", value:"大溪水", },
        { key:"丙辰", value:"沙中土", },
        { key:"丁巳", value:"沙中土", },
        { key:"戊午", value:"天上火", },
        { key:"己未", value:"天上火", },
        { key:"庚申", value:"石榴木", },
        { key:"辛酉", value:"石榴木", },
        { key:"壬戌", value:"大海水", },
        { key:"癸亥", value:"大海水", }
      ]
    ],

    nayinListV1 : [
      {key:1, value:"海中金"},
      {key:2, value:"炉中火"},
      {key:3, value:"大林木"},
      {key:4, value:"路旁土"},
      {key:5, value:"剑锋金"},

      {key:6, value:"山头火"},
      {key:7, value:"涧下水"},
      {key:8, value:"城墙土"},
      {key:9, value:"白腊金"},
      {key:10, value:"杨柳木"},

      {key:11, value:"泉中水"},
      {key:12, value:"屋上土"},
      {key:13, value:"霹雳火"},
      {key:14, value:"松柏木"},
      {key:15, value:"长流水"},

      {key:16, value:"沙中金"},
      {key:17, value:"山下火"},
      {key:18, value:"平地木"},
      {key:19, value:"壁上土"},
      {key:20, value:"金箔金"},

      {key:21, value:"覆灯火"},
      {key:22, value:"天河水"},
      {key:23, value:"大驿土"},
      {key:24, value:"钗钏金"},
      {key:25, value:"桑柘木"},

      {key:26, value:"大溪水"},
      {key:27, value:"沙中土"},
      {key:28, value:"天上火"},
      {key:29, value:"石榴木"},
      {key:30, value:"大海水"},
    ],

    zsss : {
      甲:["沐浴","冠带","临官","帝旺","衰","病","死","墓","绝","胎","养","长生"],
      乙:["病","衰","帝旺","临官","冠带","沐浴","长生","养","胎","绝","墓","死"],
      丙:["胎","养","长生","沐浴","冠带","临官","帝旺","衰","病","死","墓","绝"],
      丁:["绝","墓","死","病","衰","帝旺","临官","冠带","沐浴","长生","养","胎"],
      戊:["胎","养","长生","沐浴","冠带","临官","帝旺","衰","病","死","墓","绝"],
      己:["绝","墓","死","病","衰","帝旺","临官","冠带","沐浴","长生","养","胎"],
      庚:["死","墓","绝","胎","养","长生","沐浴","冠带","临官","帝旺","衰","病"],
      辛:["长生","养","胎","绝","墓","死","病","衰","帝旺","临官","冠带","沐浴"],
      壬:["帝旺","衰","病","死","墓","绝","胎","养","长生","沐浴","冠带","临官"],
      癸:["临官","冠带","沐浴","长生","养","胎","绝","墓","死","病","衰","帝旺"]   	
    },

    cangdun : {
        子:["癸",48],
        丑:["己",16,"癸",8,"辛",4],
        寅:["甲",32,"丙",16,"戊",8],
        卯:["乙",48],
        辰:["戊",16,"乙",8,"壬",8,],
        巳:["丙",32,"庚",8,"戊",8],
        午:["丁",48,"己",24],
        未:["己",32,"丁",8,"乙",8],
        申:["庚",32,"壬",16,"戊",8],
        酉:["辛",48],
        戌:["戊",32,"丁",8,"辛",8],
        亥:["壬",32,"甲",16],
    }
}

export {
  sysData
}